JmeterScriptusingTaurus.yml
modules:
  blazemeter:
    token: 466382acfbf8f90ab5e6350a:f3275d04e8d73b951941e82b98d8a9977701405ff9cac1c66d7495573eba359558c7dcda
    address: https://a.blazemeter.com/
    data-address: https://data.blazemeter.com/
    browser-open: start
    send-interval: 30s
    timeout: 5s
    artifact-upload-size-limit: 5
    public-report: false
    project: taurusblazemeterproject
    test: taurusblazedemotest
    report-name: blazedemoreportname1
    
execution:
- concurrency: 4
  ramp-up: 1m
  hold-for: 1m
  scenario: quick-test

scenarios:
  quick-test:
    script: TaurusFloodio.jmx